#include <stdio.h>

/////////////////////////////////////////////////////////////////////////////////
//【程序1】
//题目：有1、2、3、4个数字，能组成多少个互不相同且无重复数字的三位数？都是多少？
//
//main()
//{
//	int i, j, k;
//	for (i = 1; i <= 4;i++)
//	for (j = 1; j <= 4; j++)
//	for (k = 1; k <= 4; k++)
//	{
//		if (i != j&&j != k&&k != i)
//			printf("\n%d%d%d", i, j, k);
//	}
//	getchar();
//}

/////////////////////////////////////////////////////////////////////////////////
//【程序2】
//题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高
//于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提
//成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于
//40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于
//100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
//
//main()
//{
//	float I, F;
//	scanf("%f", &I);
//	if (I <= 100000) F = 0.1*I;
//	else if (100000 < I <= 200000) F = 10000 + (I - 100000)*0.075;
//	else if (200000 < I <= 400000) F = 17500 + (I - 200000)*0.05;
//	else if (400000 < I <= 600000) F = (17500 + (I - 200000)*0.05) + ((17500 + (I - 200000)*0.05) - 400000)*0.03;//27500 + (I - 400000)*0.03;
//	else if (600000 < I <= 1000000) F = 33500 + (I - 600000)*0.015;
//	else F = 39500 + (I - 1000000)*0.01;
//	printf("%.2f", F);
//	getchar();
//	getchar();
//}

////////////////////////////////////////////////////////////////////////////////
//【程序3】
//题目：在10万以内判断一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
//
//#include<math.h>
//main()
//{
//	int i, a;
//	for (i = 1; i <= 100000; i++)
//	{
//		a = sqrt(i);
//		if (a*a == i) printf("%d ", i);
//	}
//	getchar();
//}

////////////////////////////////////////////////////////////////////////////////
//【程序4】
//题目：输入某年某月某日，判断这一天是这一年的第几天？
//判断闰年条件①：非整百年数除以4，无余为闰，有余为平；②整百年数除以400，无余为闰有余平。
//
//int Year(int y)			//返回1为闰年，0为平年
//{
//	if (y % 100 != 0)
//	{
//		if (y % 4 != 0) return 1;
//		else return 0;
//	}
//	else
//	{
//		if (y % 400 != 0) return 1;
//		else return 0;
//	}
//}
//
//int Month(int y, int m)
//{
//	if (m == 1, 3, 5, 7, 8, 10, 12) return(31);
//	else if (m == 4, 6, 9, 11) return(30);
//	else
//	{
//		if (y == 1) return(29);
//		else return(28);
//	}
//}
//
//main()
//{
//	int Y=2015, M=1, D=1, a, b, c=0, i;
//	printf("输入日期:");
//	scanf("%d%d%d", &Y, &M, &D);
//	a = Year(Y);
//	for (i = 1; i < M; i++)
//	{
//		b = Month(a, M);
//		c = b + c;
//	}
//	c = c + D;
//	printf("%d年%d月%d日为%d年的第%d天",Y,M,D,Y,c);
//	getchar();
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序5】
//题目：输入三个整数x, y, z，请把这三个数由小到大输出。
//
//main()
//{
//	int x, y, z, t;
//	printf("输入三个数:");
//	scanf("%d%d%d", &x, &y, &z);
//	if (x>y)
//	{
//		t = x; x = y; y = t;
//	}
//	if (x>z)
//	{
//		t = z; z = x; x = t;
//	} 
//	if (y>z)
//	{
//		t = y; y = z; z = t;
//	} 
//	printf("数从小到大:%d %d %d", x, y, z);
//	getchar();
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序6】
//题目：输出9 * 9口诀。
//
//main()
//{
//	int i, j, k;
//	for (i = 1; i <= 9; i++)
//	{
//		for (j = 1; j <= i; j++)
//		{
//			k = i*j;
//			printf("%5d ", k);
//		}
//		printf("\n");
//	}
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序7】
//题目：古典问题：有一对兔子，从出生后第3个月起每个月都生一对兔子，小兔子长到
//第三个月后每个月又生一对兔子，假如兔子都不死，问每个月的兔子总数为多少？
//
//main()
//{
//	int i, a[12];
//	a[0] = a[1] = 1;
//	printf(" 1月一共%d对兔子\n", a[0]);
//	printf(" 2月一共%d对兔子\n", a[1]);
//	for (i = 2; i <= 11; i++)
//	{
//		a[i] = a[i - 1] + a[i - 2];
//		printf("%2d月一共%d对兔子\n", i+1,a[i]);
//	}
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序8】
//题目：判断101 - 200之间有多少个素数，并输出所有素数。
//判断素数的方法：用一个数分别去除2到sqrt(这个数)，如果能被整除，则表明此数不是素数，反之是素数。
//
//#include<math.h>
//main()
//{
//	int i , j;
//	for (i = 101; i <= 200; i++)
//	{
//		for (j = 2; j <= (int)sqrt(i);j++)
//		if (i%j != 0)
//		{
//			printf("%3d ", i);
//			break;
//		}
//		else break;
//	}
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序9】
//题目：打印出所有的“水仙花数”，所谓“水仙花数”是指一个三位数，其各位数字立方和等于该数
//本身。
//
//main()
//{
//	int i, a, b, c;
//	for (i = 100; i <= 999; i++)
//	{
//		a = i / 100;
//		b = (i-a*100) / 10;
//		c = i % 10;
//		if (i == a*a*a + b*b*b + c*c*c)
//			printf("%3d  ", i);
//	}
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序10】
//题目：将一个正整数分解质因数。例如：输入90, 打印出90 = 2 * 3 * 3 * 5。
//程序分析：对n进行分解质因数，应先找到一个最小的质数k，然后按下述步骤完成：
//(1)如果这个质数恰等于n，则说明分解质因数的过程已经结束，打印出即可。
//(2)如果n<>k，但n能被k整除，则应打印出k的值，并用n除以k的商, 作为新的正整数你n,
//重复执行第一步。
//(3)如果n不能被k整除，则用k + 1作为k的值, 重复执行第一步。
//
//main()
//{
//	int i, n;
//	scanf("%d", &n);
//	for (i = 2; i <= n; i++)
//	{
//		while (i != n)
//		{
//			if (n % i == 0)
//			{
//				printf(" %d", i);
//				n = n / i;
//			}
//			else break;
//		}
//	}
//	printf(" %d", n);
//	getchar();
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序11】
//题目：输入两个正整数m和n，求其最大公约数和最小公倍数。**辗除法**
//最小公约数=两数相乘/最大公约数
//
//int GYS(int a, int b)             //求a，b最大公约数
//{
//	int c;
//	if (a < b)
//	{
//		c = a;
//		a = b;
//		b = c;
//	}
//	while (a%b != 0)				//求a，b最小公倍数
//	{
//		c = a%b;
//		a = b;
//		b = c;
//	}
//	return b;
//}
//
//void GBS(int a, int b)
//{
//	int c;
//	c = (a*b) / GYS(a, b);
//	printf("最小公倍数：%d",c);
//}
//
//main()
//{
//	int a, b, c;
//	scanf("%d%d", &a,&b);
//	printf("\n最大公约数:%d\n",GYS(a, b));
//	printf("\n");
//	GBS(a,b);
//	getchar();
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序12】
//题目：输入一行字符，分别统计出其中英文字母、空格、数字和其它字符的个数。
//程序分析：利用while语句, 条件为输入的字符不为'\n'.
//
//main()
//{
//	int letter = 0, space = 0, number = 0, other = 0;
//	char i;
//	while ((i = getchar()) != '\n')
//	{
//		if ((i >= 'a'&&i <= 'z') || (i >= 'A'&&i <= 'Z'))
//			letter++;
//		else if (i == ' ')
//			space++;
//		else if (i >= '0'&&i <= '9')
//			number++;
//		else other++;
//	}
//	printf("字母:%d\n",letter);
//	printf("空格:%d\n",space);
//	printf("数字:%d\n",number);
//	printf("其它:%d\n",other);
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序13】
//题目：求s = a + aa + aaa + aaaa + aa...a的值，其中a是一个数字。例如2 + 22 + 222 + 2222 + 22222(此时
//	共有5个数相加)，几个数相加有键盘控制。
//	1.程序分析：关键是计算出每一项的值。
//
//main()
//{
//	int a, i, j;
//	int s[20];
//	scanf("%d", &a);
//	scanf("%d", &i);
//	for (j = 0; j < i; j++) 
//		s[j] = a;
//	for (j = 0; j < i; j++)
//		s[j] = s[j] * (j + 1);
//	for (j = 0; j < i; j++)
//		printf("%d", s[j]);
//	getchar();
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序14】
//题目：一球从100米高度自由落下，每次落地后反跳回原高度的一半；再落下，求它在
//第10次落地时，共经过多少米？第10次反弹多高？
//
//main()
//{
//	int h = 100, i, n, s;
//	scanf("%d", &n);
//	s = h;
//	for (i = 1; i <= n; i++)
//	{
//		h = h / 2;
//		s = s + h;
//	}
//	printf("第%d次反弹%d米\n", n, h);
//	printf("共经过%d米\n", s);
//	getchar(); 
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序15】
//题目：猴子吃桃问题：猴子第一天摘下若干个桃子，当即吃了一半，还不瘾，又多吃了一个
//第二天早上又将剩下的桃子吃掉一半，又多吃了一个。以后每天早上都吃了前一天剩下
//的一半零一个。到第10天早上想再吃时，见只剩下一个桃子了。求第一天共摘了多少。
//程序分析：采取逆向思维的方法，从后往前推断。
//
//main()
//{
//	int a = 1, i;
//	for (i = 1; i < 10; i++)
//	{
//		a = 2 * (a + 1);
//	}
//	printf("共%d个", a);
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序16】
//题目：两个乒乓球队进行比赛，各出三人。甲队为a, b, c三人，乙队为x, y, z三人。已抽签决定
//比赛名单。有人向队员打听比赛的名单。a说他不和x比，c说他不和x, z比，请编程序找出
//三队赛手的名单。
//
//main()
//{
//	int a, b, c, x = 1, y = 2, z = 3, i, j, k;
//	for (i = 1; i <= 3; i++)
//	{
//		a = i;
//		for (j = 1; j <= 3; j++)
//		{
//			c = j;
//			if (a != 1 && a!=c && c != 1 && c != 3)
//			{
//				for (k = 1; k <= 3; k++)
//				{
//					b = k;
//					if (b != a && b != c)
//					{
//						printf("%d", a);
//						printf("%d", b);
//						printf("%d", c);
//					}
//				}
//			}
//		}
//	}
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序17】
//题目：有一分数序列：2 / 1，3 / 2，5 / 3，8 / 5，13 / 8，21 / 13...求出这个数列的前20项之和。
//1.程序分析：请抓住分子与分母的变化规律。
//
//main()
//{
//	float a = 2, b = 1, s, i, t;
//	s = a / b;
//	for (i = 2; i <= 20; i++)
//	{
//		t = a;
//		a = a + b;
//		b = t;
//		s = s + a / b;
//	}
//	printf("%0.2f", s);
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序18】
//题目：利用递归方法求5!。
//程序分析：递归公式：fn = fn_1 * 4!
//
//int fun(int n)
//{
//	if (n > 1)
//		return fun(n - 1)*n;
//	else
//		return 1;
//}
//
//main()
//{
//	int n;
//	scanf("%d", &n);
//	printf("%d",fun(n));
//	getchar();
//	getchar();
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序19】
//题目：利用递归函数调用方式，将所输入的5个字符，以相反顺序打印出来。
//
//#include "stdio.h"
//#include "conio.h"
//main()
//{
//	int i = 5;
//	void palin(int n);
//	printf("\40:");
//	palin(i);
//	printf("\n");
//	getch();
//}
//void palin(n)
//int n;
//{
//	char next;
//	if (n <= 1)
//	{
//		next = getchar();
//		printf("\n\0:");
//		putchar(next);
//	}
//	else
//	{
//		next = getchar();
//		palin(n - 1);
//		putchar(next);
//	}
//}

//////////////////////////////////////////////////////////////////////////////////
//【程序20】
//题目：有5个人坐在一起，问第五个人多少岁？他说比第4个人大2岁。问第4个人岁数，他说比第
//3个人大2岁。问第三个人，又说比第2人大两岁。问第2个人，说比第一个人大两岁。最后
//问第一个人，他说是10岁。请问第五个人多大？
//1.程序分析：利用递归的方法，递归分为回推和递推两个阶段。要想知道第五个人岁数，需知道
//第四人的岁数，依次类推，推到第一人（10岁），再往回推。
//
int fun()
{
	
}

main()
{
	
}













